{
  "courses": [
    {
      "courseId": 1,
      "name": "ΛΟΓΙΚΗ ΣΧΕΔΙΑΣΗ ΨΗΦΙΑΚΩΝ ΣΥΣΤΗΜΑΤΩΝ",
      "description": "Το μάθημα \"Λογική Σχεδίαση Ψηφιακών Συστημάτων\" εξετάζει τη σχεδίαση και λειτουργία των ψηφιακών συστημάτων. Καλύπτει θέματα όπως το δυαδικό σύστημα αρίθμησης, άλγεβρα Boole και εφαρμογές της, αριθμητικά κυκλώματα, σύγχρονα ακολουθιακά κυκλώματα , μηχα-νές καταστάσεων, μονάδες μνήμης, ψηφιακά ολοκληρωμένα κυκλώματα, προσομοίωση κυκλωμάτων και γλώσσες περιγραφής υλικού.",
      "semester": 1,
      "trackId": null
    },
    {
      "courseId": 2,
      "name": "ΜΑΘΗΜΑΤΙΚΑ ΤΩΝ ΥΠΟΛΟΓΙΣΤΩΝ",
      "description": "Το μάθημα \"Μαθηματικά των υπολογιστών\" παρέχει μια εισαγωγή στη θεωρία συνόλων και βασικών αρχών των μαθηματικών, όπως η μαθηματική επαγωγή, αρχή εγκλεισμού – αποκλεισμού, αρχή του Περιστερεώνα και αρχή της διαγωνιοποίησης. Περιλαμβάνει, επίσης, τη μα-θηματική λογική, την άλγεβρα Boole, τη συνδυαστική ανάλυση, τις διαφορές και τα αθροίσματα, καθώς και στοιχεία της θεωρίας αριθμών.",
      "semester": 1,
      "trackId": null
    },
    {
      "courseId": 3,
      "name": "ΤΕΧΝΟΛΟΓΙΕΣ ΔΙΑΔΙΚΤΥΟΥ",
      "description": "Στο μάθημα αυτό περιγράφονται με εισαγωγικό, αλλά πλήρη, τρόπο οι τεχνολογίες και τα πρωτόκολλα πάνω στα οποία στηρίζονται το Διαδίκτυο και ο Παγκόσμιος Ιστός και αναλύονται με περισσότερη λεπτομέρεια η ανάπτυξη εφαρμογών με τη χρήση συγκεκριμένων εργαλεί-ων/γλωσσών, οι οποίες εκτελούνται στην πλευρά του πελάτη ή/και στην πλευρά του εξυπηρετητή. Μερικές από τις έννοιες οι οποίες αντιμετωπίζονται είναι: στοίβα πρωτοκόλλων TCP/IP, επίπεδο μεταφοράς και διαδικτύου, HTML5, CSS3, Javascript, jQuery, κλήση AJAX, PHP nodejs, XML και JSON.",
      "semester": 1,
      "trackId": null
    },
    {
      "courseId": 4,
      "name": "ΕΙΣΑΓΩΓΗ ΣΤΗΝ ΕΠΙΣΤΗΜΗ ΤΩΝ ΥΠΟΛΟΓΙΣΤΩΝ",
      "description": "Το μάθημα \"Εισαγωγή στην Επιστήμη των Υπολογιστών\" προσφέρει μια εισαγωγή στις βασικές αρχές και τις έννοιες της επιστήμης των υπολογιστών. Περιλαμβάνει θέματα όπως η αναπαράσταση και κωδικοποίηση δεδομένων, η άλγεβρα Boole, αλγορίθμους, βασικές αρχές των λειτουργικών συστημάτων, γλώσσες προγραμματισμού, δομές δεδομένων, σφάλματα και εξαι-ρέσεις, καθώς και συλλογή δεδομένων από το διαδίκτυο. Αυτά τα θέματα παρέχουν τις βασικές γνώσεις και τις δεξιότητες που απαιτούνται για την κατανόηση και την ανάπτυξη υπολογιστικών συστημάτων και λογισμικού.",
      "semester": 1,
      "trackId": null
    },
    {
      "courseId": 5,
      "name": "ΔΙΑΚΡΙΤΑ ΜΑΘΗΜΑΤΙΚΑ",
      "description": "Το μάθημα \"Διακριτά Μαθηματικά\" παρέχει μια εισαγωγή σε διάφορα θέματα των διακριτών μαθηματικών. Οι κύριοι τομείς που καλύπτονται είναι η θεωρία γραφημάτων και οι εφαρμογές της στους αλγόριθμους, οι γεννήτριες συναρτήσεις, οι αναγωγικές εξισώσεις, οι ασυμπτωτικές εκτιμήσεις, οι γλώσσες και αυτόματα. ",
      "semester": 1,
      "trackId": null
    },
    {
      "courseId": 6,
      "name": "ΔΟΜΕΣ ΔΕΔΟΜΕΝΩΝ",
      "description": "Το αντικείμενο του μαθήματος είναι η μελέτη των βασικών δομών δεδομένων που χρησιμοποιούνται στην ανάπτυξη αλγορίθμων. Έμφαση δίνεται στο χρόνο εκτέλεσης των βασικών λειτουργιών των δομών δεδομένων και στον αναλυτικό προσδιορισμό του πλήθους των βασικών εντολών που απαιτούνται για την ολοκλήρωσή τους. Συγκεκριμένα, παρουσιάζονται οι δομές του πίνακα, της διασυνδεδεμένης λίστας, της στοίβας, της ουράς, του σωρού, των δυαδικών δέντρων αναζήτησης. Επίσης, παρουσιάζονται η τεχνική του κατακερματισμού (hashing), τα ισοζυγισμένα δέντρα αναζήτησης (AVL, Red-Black και Β-δέντρα) καθώς και βασικοί αλγόριθμοι ταξινόμησης",
      "semester": 2,
      "trackId": null
    },
    {
      "courseId": 7,
      "name": "ΑΝΤΙΚΕΙΜΕΝΟΣΤΡΕΦΗΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ",
      "description": "ΤΑντικείμενο του μαθήματος είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού JAVA. Καλύπτει βασικές αρχές τις όπως βασι-κές δομές, κληρονομικότητα, πολυμορφισμός, ενθυλάκωση, ειδικές κλάσεις, εξαιρέσεις, ειδικά θέματα, βιβλιοθήκες, διαπροσωπίες, προσπέλαση αρχείων, access modifiers, non-access modifiers. (hashing), τα ισοζυγισμένα δέντρα αναζήτησης (AVL, Red-Black και Β-δέντρα) καθώς και αλγόριθμοι ταξινόμησης.",
      "semester": 2,
      "trackId": null
    },
    {
      "courseId": 8,
      "name": "ΑΡΧΙΤΕΚΤΟΝΙΚΗ ΥΠΟΛΟΓΙΣΤΩΝ",
      "description": "Το μάθημα \"Αρχιτεκτονική Υπολογιστών\" εστιάζει στην οργάνωση, τη σχεδίαση και την τεχνο-λογία των υπολογιστών. Παρουσιάζει την αρχιτεκτονική συνόλου εντολών, περιλαμβάνοντας τους καταχωρητές, τις εντολές και τους τρόπους διευθυνσιοδότησης. Επίσης, μελετά τη γλώσ-σα μηχανής, τη συμβολική γλώσσα (Assembly) και τους συμβολομεταφραστές (Assemblers). Τέλος, στο μάθημα αναλύονται οι αριθμητικές πτυχές των υπολογιστών, όπως η αναπαράστα-ση ακεραίων αριθμών και αριθμών κινητής υποδιαστολής.",
      "semester": 2,
      "trackId": null
    },
    {
      "courseId": 9,
      "name": "ΜΑΘΗΜΑΤΙΚΟΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ",
      "description": "Το μάθημα εντάσσεται στο επιστημονικό πεδίο της επιχειρησιακής έρευνας. Αναφέρεται σε μία από τις βασικές τεχνικές βελτιστοποίησης της επιχειρηματικής έρευνας, τον γραμμικό προγραμματισμό, ο οποίος προσφέρει την μεθοδολογική προσέγγιση και το πλαίσιο επίλυσης πολ-λών προβλημάτων της οργάνωσης και της διοίκησης.",
      "semester": 3,
      "trackId": null
    },
    {
      "courseId": 10,
      "name": "ΑΝΤΙΚΕΙΜΕΝΟΣΤΡΕΦΗΣ ΑΝΑΠΤΥΞΗ ΕΦΑΡΜΟΓΩΝ",
      "description": "Το αντικείμενο του μαθήματος είναι η ανάπτυξη εφαρμογών αντικειμενοστρεφούς μοντέλου ανάπτυξης λογισμικού. Στο πλαίσιο του μαθήματος δίνεται ιδιαίτερη έμφαση στα εργαλεία α-νάπτυξης εφαρμογών, ολοκληρωμένα περιβάλλοντα ανάπτυξης (IDEs). Με τη χρήση του Visual Studio και της C# ως γλώσσας προγραμματισμού, οι φοιτητές μαθαίνουν να αναπτύσσουν desktop, web, ή/και mobile εφαρμογές, γρήγορα, αποδοτικά και κυρίως με την όσο το δυνατόν μικρότερη πιθανότητα να κάνουν λάθη προγραμματισμού ή/και λογικής",
      "semester": 3,
      "trackId": null
    },
    {
      "courseId": 11,
      "name": "ΛΕΙΤΟΥΡΓΙΚΑ ΣΥΣΤΗΜΑΤΑ",
      "description": "Βασικές έννοιες και αρχές Λειτουργικών Συστημάτων. Αρχιτεκτονική, δομή και κατηγοριοποίηση Λειτουργικών Συστημάτων. Διεργασίες, Νήματα. Δια-διεργασιακή επικοι-νωνία. Χρονοδρομολόγηση της CPU. Σύστημα μνήμης. Διαχείριση μνήμης. Εικονική Μνήμη. Σελιδοποίηση. Αλγόριθμοι διαχείρισης μνήμης. Διαχείριση Αρχείων και καταλόγων. Συστήματα Αρχείων. Είσοδος/Έξοδος. Αδιέξοδα.",
      "semester": 3,
      "trackId": null
    },
    {
      "courseId": 12,
      "name": "ΜΕΤΑΓΛΩΤΤΙΣΤΕΣ",
      "description": "Το μάθημα ασχολείται με τη Θεωρία των Γλωσσών, την κατασκευή αυτομάτων αναγνώρισης λεκτικών μονάδων, αλλά και επιμέρους τμήματα, που αποτελούν τη βάση της δημιουργίας ε-νός μεταγλωττιστή (compiler) μιας γλώσσας προγραμματισμού, την Αναζήτηση, ανάλυση και σύνθεση δεδομένων και πληροφοριών, με τη χρήση και των απαραίτητων τεχνολογιών.",
      "semester": 3,
      "trackId": null
    },
    {
      "courseId": 13,
      "name": "ΠΙΘΑΝΟΤΗΤΕΣ ΚΑΙ ΣΤΑΤΙΣΤΙΚΗ",
      "description": "Το μάθημα \"Πιθανότητες και Στατιστική\" παρουσιάζει μια εισαγωγή στις βασικές έννοιες και μεθόδους της πιθανότητας και της στατιστικής. Οι φοιτητές μελετούν πειράματα τύχης, δειγματοχώρους και γεγονότα, και εξετάζουν την αξιωματική θεμελίωση της πιθανότητας. Επίσης, αναλύονται οι πιθανότητες ένωσης γεγονότων, η δεσμευμένη πιθανότητα και η α-νεξαρτησία. Το μάθημα καλύπτει επίσης τις τυχαίες μεταβλητές, τις συναρτήσεις κατανο-μής και πυκνότητας πιθανότητας και τις πολυδιάστατες τυχαίες μεταβλητές. Τέλος, πραγματοποιείται εισαγωγή στην περιγραφική στατιστική, τη στατιστική συμπερασματολογία και τους έλεγχους στατιστικών υποθέσεων.",
      "semester": 3,
      "trackId": null
    },
    {
      "courseId": 14,
      "name": "ΔΙΚΤΥΑ ΥΠΟΛΟΓΙΣΤΩΝ ",
      "description": "Το μάθημα \"Δίκτυα Υπολογιστών\" εστιάζει στην ανάλυση και επεξήγηση των βασικών έννοιων, αρχών και πρωτοκόλλων που αφορούν στη δικτύωση. Με έμφαση στα πρωτόκολλα του Διαδικτύου, περι-γράφονται θέματα όπως οι διάφοροι τύποι δικτύων (μεταγωγής, διαδικτύων), η σχεδίαση των δικτύ-ων, η μετάδοση πληροφορίας, οι αλγόριθμοι προσπέλασης σε κοινό μέσο, οι τεχνολογίες μεταγωγής, η διαδικασία δρομολόγησης, η επικοινωνία από άκρο σε άκρο, οι ασύρματες επικοινωνίες και η επίδοση εφαρμογών. Σκοπός είναι η κατανόηση της λειτουργίας και της διαχείρισης των δικτύων υπολογιστών.",
      "semester": 4,
      "trackId": null
    },
    {
      "courseId": 15,
      "name": "ΑΛΓΟΡΙΘΜΟΙ",
      "description": "Το μάθημα \"Αλγόριθμοι\" επικεντρώνεται στη μελέτη τεχνικών επίλυσης βασικών υπολογιστικών προ-βλημάτων. Εξετάζεται ο σχεδιασμός αποδοτικών τεχνικών επίλυσης για προβλήματα στην Πληροφορική, που συντελούν στην επίλυση άλλων υπολογιστικών προβλημάτων. Επικεντρώνεται στο χρόνο εκτέλεσης των αλγορίθμων και στη μαθηματική ανάλυση τους. Παρουσιάζονται αλγόριθμοι για προβλήματα ταξινόμησης, αναζήτησης, γραφημάτων, αριθμητικών υπολογισμών και εισαγωγή στη Θεωρία Υπολογισμού.",
      "semester": 4,
      "trackId": null
    },
    {
      "courseId": 16,
      "name": "ΒΑΣΕΙΣ ΔΕΔΟΜΕΝΩΝ ",
      "description": "Το μάθημα \"Βάσεις Δεδομένων\" παρέχει γνώσεις για τον σχεδιασμό και τη χρήση των Βάσεων Δεδομένων (ΒΔ), που αποτελούν κρίσιμο στοιχείο κάθε Πληροφοριακού Συστήματος (ΠΣ). Το περιεχόμενο περιλαμβάνει το θεωρητικό υπόβαθρο με το Σχεσιακό Μοντέλο και τη Σχεσιακή Άλγεβρα, την εκμά-θηση της γλώσσας SQL (το πρότυπο των Συστημάτων Διαχείρισης ΒΔ), τεχνικές σχεδίασης Σχεσιακών ΒΔ με έμφαση στη θεωρία της κανονικοποίησης, καθώς και εργαστηριακές ασκήσεις με το PostgreSQL, ένα δημοφιλές σύστημα διαχείρισης ΒΔ.",
      "semester": 4,
      "trackId": null
    },
    {
      "courseId": 17,
      "name": "ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΣΤΟ ΔΙΑΔΙΚΤΥΟ ΚΑΙ ΤΟΝ ΠΑΓΚΟΣΜΙΟ ΙΣΤΟ",
      "description": "Το μάθημα \"Προγραμματισμός στο Διαδίκτυο και τον Παγκόσμιο Ιστό\" ασχολείται με τη θεωρητική μελέτη και την πρακτική εξάσκηση σε θέματα προγραμματισμού στο διαδίκτυο και τον παγκόσμιο ιστό. Περιλαμβάνει αρχιτεκτονική πελάτη-εξυπηρετητή, δικτυακό προγραμματισμό, πρωτόκολλο HTTP, υλοποίηση web server, παραλλαγές αρχιτεκτονικής πελάτη-εξυπηρετητή, προγραμματισμό από την πλευρά του εξυπηρετητή (Java servlets) και μόνιμη αποθήκευση δεδομένων σε διαδικτυακές εφαρμογές. Οι φοιτητές εκπαιδεύονται σε τεχνικές που αφορούν την ανάπτυξη και τη λειτουργία των διαδικτυακών εφαρμογών.",
      "semester": 4,
      "trackId": null
    },
    {
      "courseId": 18,
      "name": "ΑΡΧΕΣ ΚΑΙ ΕΦΑΡΜΟΓΕΣ ΣΗΜΑΤΩΝ ΚΑΙ ΣΥΣΤΗΜΑΤΩΝ",
      "description": "Το μάθημα \"Αρχές και Εφαρμογές Σημάτων και Συστημάτων\" εξετάζει τη θεωρία και τις εφαρμογές των σημάτων και των συστημάτων. Αποτελεί θεμελιώδες μάθημα σε προπτυχιακά προγράμματα, συμπεριλαμβανομένων των προγραμμάτων σπουδών στη σύγχρονη Πληροφορική. Παράλληλα, δη-μιουργεί τις βάσεις για εξειδικευμένα τεχνολογικά μαθήματα, όπως Αναγνώριση Προτύπων, Ανάλυση Εικόνας, Τεχνητή Όραση, Τηλεπικοινωνιακά Συστήματα, Δίκτυα Υπολογιστών, Συστήματα Πολυμέσων, Επεξεργασία Φωνής, κ.ά. Οι ενότητες του μαθήματος περιλαμβάνουν ένα εισαγωγικό μέρος για τις έννοιες του σήματος και του συστήματος, μετασχηματισμούς σημάτων, δειγματοληψία και κβά-ντωση σημάτων, γραμμικά αναλλοίωτα συστήματα, συστήματα επικοινωνίας και διαμόρφωση, ψηφιακά συστήματα επικοινωνίας, και το προγραμματιστικό περιβάλλον MATLAB.",
      "semester": 4,
      "trackId": null
    },
    {
      "courseId": 19,
      "name": "ΑΛΛΗΛΕΠΙΔΡΑΣΗ ΑΝΘΡΩΠΟΥ ΚΑΙ ΥΠΟΛΟΓΙΣΤΗ",
      "description": "Το μάθημα \"Αλληλεπίδραση Ανθρώπου και Υπολογιστή\" ασχολείται με τον σχεδιασμό του συστήματος διεπαφής ανθρώπου-υπολογιστή. Μελετά την ανθρώπινη πλευρά της αλληλεπίδρα-σης, εστιάζοντας στις ανάγκες, τις δυνατότητες και τις προκλήσεις που αντιμετωπίζει ο χρή-στης. Εξετάζει τα κλασικά και σύγχρονα μέσα επικοινωνίας του υπολογιστή και αναλύει τα μο-ντέλα αλληλεπίδρασης. Επικεντρώνεται στους στόχους, τις μεθόδους και την ανάλυση εργα-σιών που χρησιμοποιούνται για τον σχεδιασμό αποτελεσματικών συστημάτων διεπαφής. Τέ-λος, το μάθημα αναφέρεται στη χρηστικότητα και τη φιλικότητα του λογισμικού, εξετάζοντας τη σημασία της σχεδίασης διεπαφής που προσφέρει ευκολία στον χρήστη και βελτιώνει την εμπειρία χρήσης.",
      "semester": 5,
      "trackId": null
    },
    {
      "courseId": 20,
      "name": "ΑΝΑΓΝΩΡΙΣΗ ΠΡΟΤΥΠΩΝ",
      "description": "Αναγνώριση Προτύπων (pattern recognition) είναι η επιστημονική περιοχή που έχει στόχο την ταξινόμηση αντικειμένων σε κατηγορίες (κλάσεις) και συμπεριλαμβάνει το επιστημονικό πεδίο της Μηχανικής Μάθησης (machine learning). Σκοπός, επομένως, του παρόντος μαθήματος είναι να παρουσιάσει με ενιαίο τρόπο τις ευρύτερα χρησιμοποιούμενες τεχνικές και μεθοδολο-γίες για προβλήματα αναγνώρισης προτύπων.",
      "semester": 5,
      "trackId": null
    },
    {
      "courseId": 21,
      "name": "ΠΛΗΡΟΦΟΡΙΑΚΑ ΣΥΣΤΗΜΑΤΑ",
      "description": "Το μάθημα \"Πληροφοριακά Συστήματα\" εστιάζει στην κατανόηση των πληροφοριακών συστη-μάτων (ΠΣ) από διοικητική, οργανωτική, σχεδιαστική και τεχνική πλευρά. Οι φοιτητές αναλύουν τα συστατικά στοιχεία ενός ΠΣ και μαθαίνουν για τους κυριότερους τύπους ΠΣ που χρησιμο-ποιούνται σήμερα. Μελετούν μεθοδολογίες ανάλυσης απαιτήσεων και μετατροπής τους σε σχεδίαση συστήματος. Επιπλέον, αναπτύσσουν ΠΣ και τα δοκιμάζουν, χρησιμοποιώντας την UML για τη δημιουργία διαφόρων μοντέλων ΠΣ. Αναλύουν περιπτώσεις χρήσης μέσω case studies.",
      "semester": 5,
      "trackId": null
    },
    {
      "courseId": 22,
      "name": "ΤΕΧΝΗΤΗ ΝΟΗΜΟΣΥΝΗ ΚΑΙ ΕΜΠΕΙΡΑ ΣΥΣΤΗΜΑΤΑ",
      "description": "Το μάθημα \"Τεχνητή Νοημοσύνη και Εμπειρα Συστήματα\" παρέχει εισαγωγικές γνώσεις στην τεχνητή νοημοσύνη και τα εμπειρα συστήματα. Οι φοιτητές ασχολούνται με την επίλυση προ-βλημάτων σε επιλεγμένες περιοχές, όπως οι γενετικοί αλγόριθμοι, χρησιμοποιώντας μεθόδους τεχνητής νοημοσύνης. Επιπλέον, αποκτούν βασικές γνώσεις στη μηχανική μάθηση και τα νευ-ρωνικά δίκτυα, που είναι σημαντικά εργαλεία στον τομέα της τεχνητής νοημοσύνης.",
      "semester": 6,
      "trackId": null
    },
    {
      "courseId": 23,
      "name": "ΤΕΧΝΟΛΟΓΙΑ ΛΟΓΙΣΜΙΚΟΥ ",
      "description": "Το μάθημα \"Τεχνολογία Λογισμικού\" συμβάλλει στην κάλυψη των τεχνολογικών απαιτήσεων μέσω της έκθεσης των φοιτητών σε σύγχρονες τεχνικές μοντελοποίησης λογισμικού, αρχιτε-κτονικό σχεδιασμό και την γλώσσα μοντελοποίησης UML. Τα θέματα που καλύπτονται περι-λαμβάνουν μοντέλα κύκλου ζωής λογισμικού, γλώσσες μοντελοποίησης (UML), προϋπολογι-σμός κόστους λογισμικού, ανάλυση απαιτήσεων, σχεδιασμός, υλοποίηση και γλώσσες προγραμματισμού, καθώς και έλεγχος, συντήρηση και εργαλεία CASE.",
      "semester": 6,
      "trackId": null
    },
    {
      "courseId": 24,
      "name": "ΣΥΣΤΗΜΑΤΑ ΔΙΑΧΕΙΡΙΣΗΣ ΒΑΣΕΩΝ ΔΕΔΟΜΕΝΩΝ",
      "description": "Το μάθημα \"Συστήματα Διαχείρισης Βάσεων Δεδομένων\" εστιάζει στη διδασκαλία βασικών αρχών και τεχνικών για τη διαχείριση βάσεων δεδομένων. Περιλαμβάνει την ανάλυση της δομής των αρχείων και των ευρετηρίων που χρησιμοποιούνται για την αποθήκευση και την ανάκτηση δεδομένων από μια βάση.  Εξετάζει τεχνικές για το σχεδιασμό και τη βελτιστοποίηση ερωτή-σεων στη βάση δεδομένων. Επίσης, στα πλαίσια του μαθήματος. εξετάζονται θέματα που σχε-τίζονται με ειδικές αρχιτεκτονικές βάσεων δεδομένων, όπως οι κατανεμημένες βάσεις, οι παράλληλες βάσεις δεδομένων και οι αρχιτεκτονικές Big Data. Τέλος, περιλαμβάνει πρακτικές ασκήσεις πάνω σε δύο δημοφιλείς συστήματα διαχείρισης βάσεων δεδομένων, το PostgreSQL και το MongoDB.",
      "semester": 5,
      "trackId": 1
    },
    {
      "courseId": 25,
      "name": "ΣΥΣΤΗΜΑΤΑ ΠΟΛΥΜΕΣΩΝ",
      "description": "Το μάθημα “Συστήματα Πολυμέσων” ασχολείται με την επιστημονική περιοχή στην οποία συ-ναντώνται και γονιμοποιούνται πληθώρα επιστημονικών πεδίων, όπως η επεξεργασία σήμα-τος, η θεωρία πληροφορίας και οι επικοινωνίες, με στόχο τη Δημιουργία, την Αποθήκευ-ση/Συμπίεση και τη Διανομή του Πολυμεσικού Περιεχομένου. Σκοπός, επομένως, του παρό-ντος μαθήματος είναι να παρουσιάσει με ενιαίο τρόπο τις θεμελιώδεις έννοιες της πολυμεσικής επεξεργασίας, τα προβλήματα που καλείται να επιλύσει η σχεδίαση πολυμεσικών συστημάτων και τις σημαντικότερες τεχνικές ψηφιοποίησης, συμπίεσης και διανομής πολυμεσικού περιεχομένου.",
      "semester": 6,
      "trackId": 1
    },
    {
      "courseId": 26,
      "name": "ΛΟΓΙΚΟΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ",
      "description": "Το μάθημα \"Λογικός Προγραμματισμός\" εξετάζει την προτασιακή και κατηγορηματική λογική, αρχές απόφασης και στρατηγικές, μη μονότονη συμπερασματολογία και λογικό προγραμματι-σμό. Επικεντρώνεται στη γλώσσα Prolog και απλές εφαρμογές της, δομές δεδομένων, στρατη-γική αναζήτησης, αναδρομικό και διαζευκτικό προγραμματισμό, λογικό προγραμματισμό περιορισμών, παράλληλο προγραμματισμό, μεταλογικό προγραμματισμό και προχωρημένες εφαρμογές της Prolog.",
      "semester": 5,
      "trackId": 1
    },
    {
      "courseId": 27,
      "name": "ΕΠΕΞΕΡΓΑΣΙΑ ΦΥΣΙΚΗΣ ΓΛΩΣΣΑΣ",
      "description": "Το μάθημα \"Βιοπληροφορική\" περιλαμβάνει ενότητες όπως εισαγωγή στη βιοπληροφορική, πρόσβαση σε βιολογικά δεδομένα, στοίχιση αλληλουχιών, χρήση του εργαλείου BLAST, πολ-λαπλή στοίχιση ακολουθιών, μοριακή φυλογένεση, ανάλυση δεδομένων DNA και RNA, γονιδιακή έκφραση και πρωτεϊνική ανάλυση.",
      "semester": 6,
      "trackId": 1
    },
    {
      "courseId": 28,
      "name": "ΠΡΟΗΓΜΕΝΑ ΘΕΜΑΤΑ ΕΠΙΚΟΙΝΩΝΙΩΝ",
      "description": "Το μάθημα \"Προηγμένα Θέματα Επικοινωνιών\" επικεντρώνεται στην ανάλυση προηγμένων θεμάτων στον τομέα των επικοινωνιών. Στο μάθημα αυτό, εξετάζονται οι βασικές αρχές της α-σύρματης επικοινωνίας και η φυσική μοντελοποίηση των ασύρματων καναλιών. Επιπλέον, α-ναλύονται θέματα όπως η ασύρματη μετάδοση, η πολλαπλή πρόσβαση και η χωρητικότητα των καναλιών. Οι φοιτητές εξοικειώνονται με τις αρχιτεκτονικές των δικτύων επόμενης γενιάς (NGN) και τις αντίστοιχες εφαρμογές, καθώς και με τις δορυφορικές επικοινωνίες και τη σχεδίαση δορυφορικών ζεύξεων. Τέλος, αναλύονται οι ασύρματες δικτυακές τεχνολογίες πολλαπλών βημάτων και οι ασύρματες δικτυακές αισθητήρες (WSNs). Μέσω των περιεχομένων του μαθή-ματος, οι φοιτητές αποκτούν γνώσεις για τις προηγμένες τεχνολογίες επικοινωνιών και αναπτύσσουν τις απαιτούμενες δεξιότητες για την ανάλυση και σχεδίαση σύγχρονων επικοινωνιακών συστημάτων.",
      "semester": 5,
      "trackId": 2
    },
    {
      "courseId": 29,
      "name": "ΔΙΚΤΥΑ ΥΨΗΛΩΝ ΤΑΧΥΤΗΤΩΝ",
      "description": "Το μάθημα \"Δίκτυα Υψηλών Ταχυτήτων\" αποσκοπεί στην απόκτηση των απαραίτητων γνώσεων για τον σχεδιασμό και την ανάπτυξη δικτύων υψηλών ταχυτήτων, εστιάζοντας στις πιο πρό-σφατες επιστημονικές και τεχνολογικές εξελίξεις του χώρου. Το μάθημα περιλαμβάνει έννοιες και πρωτόκολλα ευρυζωνικών ενσύρματων και ασύρματων δικτύων, δίκτυα μεταγωγής πακέ-των, οπτικά δίκτυα, τεχνολογίες xDSL, IP δίκτυα και υπηρεσίες, ασύρματα τοπικά δίκτυα, α-σύρματα ευρυζωνικά δίκτυα, δορυφορικές επικοινωνίες και Internet of Things (IoT). Η συμβολή του μαθήματος στην κάλυψη επαγγελματικών απαιτήσεων περιλαμβάνει την εισαγωγή σε βα-σικές αρχές και αρχιτεκτονικές δικτύων υψηλών ταχυτήτων, διάφορες τεχνολογίες στον τομέα αυτό, τις έννοιες των τεχνολογιών και προτύπων επικοινωνίας, καθώς και την προσομοίωση και αξιολόγηση δικτύων υψηλών ταχυτήτων.",
      "semester": 6,
      "trackId": 2
    },
    {
      "courseId": 30,
      "name": "ΠΡΟΗΓΜΕΝΗ ΑΡΧΙΤΕΚΤΟΝΙΚΗ ΥΠΟΛΟΓΙΣΤΩΝ",
      "description": "Το μάθημα \"Προηγμένη Αρχιτεκτονική Υπολογιστών\" αποτελεί συνέχεια του μαθήματος κορμού Αρχιτεκτονική Υπολογιστών και εμβαθύνει σε θέματα οργάνωσης και σχεδίασης σύγχρονων επεξεργαστών υψηλής απόδοσης. Επικεντρώνεται στην τεχνική διοχέτευση (pipelining), ιεραρχία μνήμης (cache memory, virtual memory), συνδέσεις μεταξύ επεξεργαστή, μνήμης και συσκευών εισόδου/εξόδου, δυναμικό χρονοπογραμματισμό, πρόβλεψη διακλάδωσης και εικασία, καθώς και πολυνηματικούς και πολυπύρηνους επεξεργαστές.",
      "semester": 5,
      "trackId": 2
    },
    {
      "courseId": 31,
      "name": "ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΣΥΣΤΗΜΑΤΩΝ, ΤΗΛΕΠΙΚΟΙΝΩΝΙΩΝ ΚΑΙ ΥΠΗΡΕΣΙΩΝ",
      "description": "Το μάθημα \"Προηγμένη Αρχιτεκτονική Υπολογιστών\" αποτελεί συνέχεια του μαθήματος κορ-μού \"Αρχιτεκτονική Υπολογιστών\" και έχει ως στόχο την εμβάθυνση των φοιτητών στην οργά-νωση και σχεδίαση σύγχρονων επεξεργαστών υψηλής απόδοσης. Θα δοθεί έμφαση στην τε-χνική της διοχέτευσης (pipelining) για την αύξηση της απόδοσης, στην ιεραρχία μνήμης με τη χρήση κρυφής μνήμης (cache memory) και εικονικής μνήμης (virtual memory), στις συνδέσεις μεταξύ επεξεργαστή, μνήμης και συσκευών εισόδου/εξόδου, στον δυναμικό χρονοπογραμματισμό, την πρόβλεψη διακλάδωσης και εικασία, καθώς και στους πολυνηματικούς και πολυπύρηνους επεξεργαστές.",
      "semester": 6,
      "trackId": 2
    },
    {
      "courseId": 32,
      "name": "ΣΧΕΔΙΑΣΗ ΥΠΟΛΟΓΙΣΤΙΚΩΝ ΣΥΣΤΗΜΑΤΩΝ",
      "description": "Το μάθημα \"Σχεδίαση Υπολογιστικών Συστημάτων\" εμβαθύνει στη σχεδίαση ψηφιακών συ-στημάτων, αποτελώντας συνέχεια του μαθήματος Λογικής Σχεδίασης Ψηφιακών Συστημάτων. Περιλαμβάνει θέματα όπως μοντελοποίηση κυκλωμάτων, γλώσσες περιγραφής υλικού (VHDL), σχεδίαση συνδυαστικών και ακολουθιακών κυκλωμάτων, μνήμες, μικροπεξεργαστές, προσο-μοίωση κυκλωμάτων, σύνθεση κυκλωμάτων και χρήση FPGAs στη σχεδίαση ψηφιακών κυ-κλωμάτων.",
      "semester": 6,
      "trackId": 2
    },
    {
      "courseId": 33,
      "name": "ΚΡΥΠΤΟΓΡΑΦΙΑ",
      "description": "Το μάθημα \"Κρυπτογραφία\" παρέχει μια εισαγωγή στην κρυπτογραφία και την ιστορική της εξέλιξη. Στα πλαίσια του, γίνεται αναφορά σε μαθηματικές έννοιες, όπως οι ομάδες, τα πεπε-ρασμένα σώματα και οι δακτύλιοι, καθώς και ο αλγόριθμος του Ευκλείδη και η συνάρτηση του Euler. Εξετάζονται αλγόριθμοι ιδιωτικού κλειδιού, όπως η μονοαλφαβητική αντικατάσταση και οι αλγόριθμοι του Καίσαρα, Vigenere και Hill. Επίσης, αναλύονται αλγόριθμοι κρυπτογράφησης όπως οι DES και AES. Το μάθημα περιλαμβάνει, επίσης, ομομορφική κρυπτογραφία, συναρτή-σεις κατακερματισμού, ψηφιακές υπογραφές και εφαρμογές της κρυπτογραφίας και των πρω-τοκόλλων. Τέλος, παρουσιάζονται θέματα υλοποίησης και ανάλυση κρυπτογράφησης, όπως η γραμμική και διαφορική κρυπτανάλυση και οι αλγόριθμοι παραγοντοποίησης.",
      "semester": 5,
      "trackId": 3
    },
    {
      "courseId": 34,
      "name": "ΑΝΑΛΥΤΙΚΗ ΔΕΔΟΜΕΝΩΝ",
      "description": "Το μάθημα \"Αναλυτική Δεδομένων\" παρέχει γνώσεις σχετικά με τη σχεδίαση και υλοποίηση μεθόδων και τεχνικών Αναλυτικής Δεδομένων, η οποία είναι μια από τις πιο σύγχρονες τάσεις στην περιοχή της Πληροφορικής και της Επιστήμης Δεδομένων (Data Science). Το μάθημα πε-ριλαμβάνει εισαγωγή στην Αναλυτική Δεδομένων και προπαρασκευή δεδομένων (Data Preprocessing) για αναλυτικούς σκοπούς. Εξετάζει επίσης αλγορίθμους και τεχνικές Αναλυτικής Δεδομένων, όπως κατηγοριοποίηση/ταξινόμηση και εξόρυξη συχνών προτύπων. Δίνεται επίσης έμφαση σε ειδικά θέματα, όπως η ανάλυση δεδομένων ήχου/εικόνας και γεωγραφικής πληρο-φορίας. Οι φοιτητές πραγματοποιούν εργαστηριακές ασκήσεις χρησιμοποιώντας δημοφιλείς γλώσσες προγραμματισμού, όπως το R και το Python.",
      "semester": 6,
      "trackId": 3
    },
    {
      "courseId": 35,
      "name": "ΣΥΣΤΗΜΑΤΑ ΥΠΟΣΤΗΡΙΞΗΣ ΑΠΟΦΑΣΕΩΝ",
      "description": "Το μάθημα \"ΣΥΣΤΗΜΑΤΑ ΥΠΟΣΤΗΡΙΞΗΣ ΑΠΟΦΑΣΕΩΝ\" περιλαμβάνει εισαγωγικές έννοιες, εισα-γωγή στα συστήματα υποστήριξης αποφάσεων, αναλυτικά μοντέλα υποστήριξης αποφάσεων με προσανατολισμό στις προτιμήσεις και με προσανατολισμό στα δεδομένα, μεθοδολογίες α-νάπτυξης, μέθοδοι και τεχνικές πολυκριτηριακής ανάλυσης αποφάσεων, καθώς και την περι-βάλλουσα ανάλυση δεδομένων ως μέθοδο αποτίμησης αποδοτικότητας συστημάτων.",
      "semester": 6,
      "trackId": 3
    },
    {
      "courseId": 36,
      "name": "ΣΥΣΤΗΜΙΚΗ ΑΝΑΛΥΣΗ",
      "description": "Το μάθημα \"ΣΥΣΤΗΜΙΚΗ ΑΝΑΛΥΣΗ\" περιλαμβάνει τις βασικές έννοιες της συστημικής σκέψης στην ανάλυση συστημάτων, τη συστημική προσέγγιση στην ανάλυση συστημάτων, την οργανωτική κυβερνητική συστημάτων, στρατηγικές μεθοδολογίες υπόθεσης, διαμόρφωσης και δοκιμής συστημάτων, μεθοδολογίες σχεδιασμού και ελέγχου συστημάτων και μετασυστημάτων, πολύ-μεθοδολογίες προσέγγισης συστημάτων και πραγματικές εφαρμογές συστημικών μεθοδολογιών στη λειτουργία διεργασιών.",
      "semester": 6,
      "trackId": 3
    },
    {
      "courseId": 37,
      "name": "ΕΙΚΟΝΙΚΗ ΠΡΑΓΜΑΤΙΚΟΤΗΤΑ",
      "description": "Το μάθημα \"ΕΙΚΟΝΙΚΗ ΠΡΑΓΜΑΤΙΚΟΤΗΤΑ\" ασχολείται με τη δομή, τη λειτουργία και την ανάπτυξη εφαρμογών εικονικής πραγματικότητας. Παρουσιάζονται οι κατηγορίες συστημάτων εικονικής πραγ-ματικότητας, οι τρισδιάστατοι κόσμοι γραφικών, τα τρισδιάστατα μοντέλα αντικειμένων και η υφή επιφάνειας αντικειμένων. Επίσης, περιλαμβάνεται η διαχείριση πηγών φωτός, ήχων και κάμερας, καθώς και η δημιουργία animations. Η πλατφόρμα Unity3D αποτελεί το περιβάλλον ανάπτυξης και εξερευνάται η ανάπτυξη εφαρμογών εικονικής πραγματικότητας μέσω αυτής της πλατφόρμας.",
      "semester": 7,
      "trackId": 1
    },
    {
      "courseId": 38,
      "name": "ΑΝΑΛΥΣΗ ΕΙΚΟΝΑΣ",
      "description": "Το μάθημα \"ΑΝΑΛΥΣΗ ΕΙΚΟΝΑΣ\" επικεντρώνεται στην ανάπτυξη αλγορίθμων που επιτρέπουν σε μηχανές να κατανοούν τον οπτικό κόσμο. Εντάσσεται στο πεδίο της Τεχνητής Νοημοσύνης και έχει ως στόχο να παρουσιάσει τεχνικές και μεθοδολογίες για προβλήματα ανάλυσης εικόνας. Το περιεχόμενο του μαθήματος περιλαμβάνει εισαγωγή στην ανάλυση εικόνας, τελεστές, κατάτμηση εικόνας, με-τρήσεις αντικειμένου εικόνας, ανάλυση έγχρωμης και πολυφασματικής εικόνας, γεωμετρικές προβο-λές, τρισδιάστατη όραση, στερεοσκοπική ανάλυση, ειδικά θέματα ανάλυσης εικόνας όπως σύντηξη αισθητηρίων και βάσεις δεδομένων εικόνων.",
      "semester": 7,
      "trackId": 1
    },
    {
      "courseId": 39,
      "name": "ΣΥΓΧΡΟΝΑ ΘΕΜΑΤΑ ΤΕΧΝΟΛΟΓΙΑΣ ΛΟΓΙΣΜΙΚΟΥ",
      "description": "Το μάθημα \"ΣΥΓΧΡΟΝΑ ΘΕΜΑΤΑ ΤΕΧΝΟΛΟΓΙΑΣ ΛΟΓΙΣΜΙΚΟΥ\" επικεντρώνεται στα σύγχρονα ζητήματα της τεχνολογίας λογισμικού. Περιλαμβάνει μοντέλα ανάπτυξης λογισμικού, δομημένη και αντικειμε-νοστρεφή ανάλυση, αρχιτεκτονικό σχεδιασμό και ανάπτυξη εφαρμογών για σύγχρονες κινητές συ-σκευές με ενσωματωμένο λειτουργικό σύστημα. Αναλύονται τα δημοφιλέστερα λειτουργικά συστή-ματα και εργαλεία ανάπτυξης, ενώ επικεντρώνεται κυρίως στην αντικειμενοστρεφή γλώσσα προ-γραμματισμού Java και την ανάπτυξη εφαρμογών για Android συσκευές. Επιπλέον, περιλαμβάνει αισθητήρες, γεοεντοπισμό και προχωρημένες τεχνικές προγραμματισμού όπως ασύγχρονος προγραμματισμός, υπηρεσίες Android, δέκτες εκπομπής και intents. Το μάθημα χρησιμοποιεί το περιβάλλον ανάπτυξης λογισμικού Android Studio.",
      "semester": 7,
      "trackId": 1
    },
    {
      "courseId": 40,
      "name": "ΚΑΤΑΝΕΜΗΜΕΝΑ ΚΑΙ ΠΟΛΥΕΠΕΞΕΡΓΑΣΤΙΚΑ ΥΠΟΛΟΓΙΣΤΙΚΑ ΣΥΣΤΗΜΑΤΑ",
      "description": "Το μάθημα \"Κατανεμημένα και Πολυεπεξεργαστικά Υπολογιστικά Συστήματα\" εστιάζει σε προηγμένα θέματα από την περιοχή των κατανεμημένων συστημάτων και των πολυεπεξεργαστικών υπολογιστι-κών συστημάτων. Το μάθημα καλύπτει θέματα όπως η επικοινωνία και η αλληλεπίδραση σε κατανεμημένα συστήματα, η οργάνωση εξυπηρετητών και η διαχείριση διεργασιών, ο συγχρονισμός και η ανοχή σφαλμάτων, καθώς και ο προγραμματισμός σε πολυεπεξεργαστές. Επίσης, αναλύονται θέματα όπως οι κατανεμημένες δοσοληψίες, ο προγραμματισμός με CUDA και οι αρχιτεκτονικές GPU. Το μάθημα αποσκοπεί στην ανάπτυξη γνώσεων και δεξιοτήτων που αφορούν τη σχεδίαση και την ανάπτυξη προηγμένων κατανεμημένων και πολυεπεξεργαστικών υπολογιστικών συστημάτων.",
      "semester": 7,
      "trackId": 2
    },
    {
      "courseId": 41,
      "name": "ΚΙΝΗΤΕΣ ΚΑΙ ΑΣΥΡΜΑΤΕΣ ΕΠΙΚΟΙΝΩΝΙΕΣ",
      "description": "Το μάθημα \"Κινητές και Ασύρματες Επικοινωνίες\" εστιάζει στις αρχές σχεδίασης και λειτουργίας των συστημάτων κινητών και ασύρματων επικοινωνιών. Καλύπτονται θέματα όπως η αρχιτεκτονική κυψελωτών συστημάτων, η κατανομή πόρων και η διαχείριση ραδιοδιαύλων, οι αρχές των συστημάτων 2G, 3G, 4G, 5G, η διαχείριση κινητικότητας, τα ασύρματα τοπικά δίκτυα (WLAN), καθώς και τα ασύρματα προσωπικά δίκτυα και τα δίκτυα μικρής εμβέλειας. Το μάθημα εξετάζει τις πιο πρόσφατες εξελίξεις στον χώρο και προσφέρει μια εκτεταμένη ανάλυση του θέματος.",
      "semester": 7,
      "trackId": 2
    },
    {
      "courseId": 42,
      "name": "ΑΣΦΑΛΕΙΑ ΠΛΗΡΟΦΟΡΙΑΚΩΝ ΣΥΣΤΗΜΑΤΩΝ",
      "description": "Το μάθημα \"ΑΣΦΑΛΕΙΑ ΠΛΗΡΟΦΟΡΙΑΚΩΝ ΣΥΣΤΗΜΑΤΩΝ\" επικεντρώνεται στην ασφάλεια της πληρο-φορίας, των συστημάτων και των εφαρμογών κατά την ανάπτυξη και λειτουργία πληροφοριακών συστημάτων. Το μάθημα καλύπτει θέματα όπως εισαγωγικές έννοιες ασφάλειας συστημάτων, συστήματα διαχείρισης ασφάλειας, κρυπτογραφικά συστήματα, υποδομή δημόσιας κλειδαριάς, έλεγχο πρόσβασης και ιδιωτικότητα, ασφάλεια στις τεχνολογίες, ασφαλείς ηλεκτρονικές υπηρεσίες και εισαγωγή στην ασφάλεια δικτύων. Αυτά τα θέματα αποτελούν βασικές πτυχές για την προστασία των πληροφοριακών συστημάτων από απειλές και επιθέσεις.",
      "semester": 7,
      "trackId": 2
    },
    {
      "courseId": 43,
      "name": "ΑΣΦΑΛΕΙΑ ΔΙΚΤΥΩΝ",
      "description": "Το μάθημα \"Ασφάλεια Δικτύων\" ασχολείται με τη θεωρητική και πρακτική μελέτη θεμάτων ασφά-λειας σε όλα τα επίπεδα δικτύων. Κατά τη διάρκεια του μαθήματος θα γίνει ανάλυση των παρακάτω ενοτήτων: εισαγωγή στην ασφάλεια δικτύων, ασφάλεια δρομολόγησης, σχεδιασμός συστημάτων Firewall, ιδιωτικά εικονικά δίκτυα (VPN), ασφάλεια επιπέδου δικτύου (IPSec) και ασφάλεια επιπέδου συνόδου (SSL/TLS). Μέσα από αυτές τις ενότητες οι φοιτητές θα εξοικειωθούν με τις βασικές αρχές και τεχνικές που αφορούν την ασφάλεια δικτύων.",
      "semester": 8,
      "trackId": 2
    },
    {
      "courseId": 44,
      "name": "ΗΛΕΚΤΡΟΝΙΚΟ ΕΠΙΧΕΙΡΕΙΝ ΚΑΙ ΚΑΙΝΟΤΟΜΙΑ",
      "description": "Το μάθημα \"Ηλεκτρονικό Επιχειρείν και Καινοτομία\" παρουσιάζει το θεωρητικό και πρακτικό πλαίσιο για τη μελέτη και ανάλυση της επιχειρηματικότητας και της καινοτομίας στο σύγχρονο επιχειρηματι-κό περιβάλλον. Το μάθημα επικεντρώνεται στην ανάλυση και την ανάπτυξη εννοιών όπως η εισαγω-γή στο ηλεκτρονικό επιχειρείν και το ηλεκτρονικό εμπόριο, η διαχείριση της ψηφιακής υποδομής, η στρατηγική του ηλεκτρονικού επιχειρείν, η διοίκηση της εφοδιαστικής αλυσίδας, το ψηφιακό μάρκε-τινγκ, η διαχείριση σχέσεων με τους πελάτες και η υλοποίηση υπηρεσιών του ψηφιακού επιχειρείν. Μέσω μελετών περιπτώσεων, όπως η Amazon, το eBay και η Dell, εξετάζονται πρακτικά παραδείγματα καινοτόμων επιχειρηματικών λύσεων που εφαρμόζονται διεθνώς.",
      "semester": 8,
      "trackId": 2
    },
    {
      "courseId": 45,
      "name": "ΠΛΗΡΟΦΟΡΙΑΚΑ ΣΥΣΤΗΜΑΤΑ ΣΤΟ ΔΙΑΔΙΚΤΥΟ",
      "description": "Το μάθημα \"Πληροφοριακά Συστήματα στο Διαδίκτυο\" επικεντρώνεται στη μελέτη των πληροφοριακών συστημάτων που λειτουργούν στο διαδίκτυο. Οι θεματικές ενότητες του μαθήματος περιλαμβά-νουν τον δικτυοκεντρικό υπολογισμό, το ηλεκτρονικό εμπόριο και ηλεκτρονικό επιχειρείν, τις νέες τεχνολογίες και εφαρμογές, τα κατανεμημένα συστήματα βασισμένα σε κείμενο, τις βασικές και προηγμένες τεχνικές προγραμματισμού και λειτουργίας στον παγκόσμιο ιστό, καθώς και τον διαδικτυακό προγραμματισμό με Java μέσω Servlets και JSP. Το μάθημα εστιάζει στην κατανόηση και ανάπτυξη πληροφοριακών συστημάτων σε ένα διαδικτυακό περιβάλλον.",
      "semester": 8,
      "trackId": 2
    },
    {
      "courseId": 46,
      "name": "ΑΝΑΚΤΗΣΗ ΠΛΗΡΟΦΟΡΙΑΣ ΚΑΙ ΑΝΑΖΗΤΗΣΗ ΣΤΟΝ ΠΑΓΚΟΣΜΙΟ ΙΣΤΟ",
      "description": "Το μάθημα \"Ανάκτηση Πληροφορίας και Αναζήτηση στον Παγκόσμιο Ιστό\" ασχολείται με τις βασικές έννοιες της ανάκτησης πληροφοριών και της αναζήτησης στον Παγκόσμιο Ιστό. Κατά τη διάρκεια του μαθήματος, παρουσιάζονται θέματα όπως η ανάκτηση Boole, το λεξιλόγιο όρων και οι λίστες καταχωρίσεων, η κατασκευή ευρετηρίου, η αξιολόγηση στην ανάκτηση πληροφοριών, η ανάδραση συνάφειας και διεύρυνση ερωτημάτων, οι βασικές αρχές αναζήτησης στον Ιστό, η σταχυολόγηση Ιστού και τα ευρετήρια, καθώς και η ανάλυση συνδέσμων. Αυτές οι έννοιες και τεχνικές αποτελούν τη βάση για την αποτελεσματική αναζήτηση και ανάκτηση πληροφοριών στον Παγκόσμιο Ιστό.",
      "semester": 7,
      "trackId": null
    },
    {
      "courseId": 47,
      "name": "ΠΡΟΣΟΜΟΙΩΣΗ ΣΥΣΤΗΜΑΤΩΝ",
      "description": "Το μάθημα \"ΠΡΟΣΟΜΟΙΩΣΗ ΣΥΣΤΗΜΑΤΩΝ\" επικεντρώνεται στην εισαγωγή, ανάπτυξη και εφαρμογή μοντέλων προσομοίωσης συστημάτων. Παρουσιάζονται θέματα σχεδιασμού μοντέλων, παραγωγής τυχαίων αριθμών και τυχαίων μεταβλητών, στοχαστικών μοντέλων, κατασκευής μοντέλων προσομοίωσης, αντικειμενοστραφούς προσομοίωσης και παρουσίασης λογισμικών προσομοίωσης όπως το VENSIM, AnyLogic και Forio. Επίσης, εξετάζονται οι εφαρμογές της προσομοίωσης σε πληροφοριακά συστήματα και δίκτυα υπολογιστών. Το μάθημα συμβάλλει στην απόκτηση βασικών γνώσεων για την προσομοίωση συστημάτων και την εφαρμογή τους στο πεδίο της πληροφορικής.",
      "semester": 7,
      "trackId": 3
    },
    {
      "courseId": 48,
      "name": "ΔΙΟΙΚΗΤΙΚΗ ΠΛΗΡΟΦΟΡΙΚΗ",
      "description": "Το μάθημα \"Διοικητική Πληροφορική\" εστιάζει στη διοίκηση και οργάνωση έργων πληροφορικής. Στο μάθημα παρουσιάζονται οι βασικές έννοιες και η διάκριση μεταξύ έργων και λειτουργιών. Εξετάζο-νται οι δομές και το πλαίσιο ενός έργου πληροφορικής, καθώς και οι φάσεις και τα βασικά στοιχεία της διοίκησης ενός έργου. Επιπλέον, μελετώνται η ανάλυση μελέτης περιπτώσεων (case studies), οι τεχνικές χρονοδιαγράμματος έργου και οι τεχνικές και μέθοδοι διοίκησης έργων πληροφορικής. Το μάθημα επικεντρώνεται επίσης στους τρόπους εφαρμογής στρατηγικών αρχών στα έργα πληροφορικής.",
      "semester": 8,
      "trackId": 3
    },
    {
      "courseId": 49,
      "name": "ΕΚΠΑΙΔΕΥΤΙΚΟ ΛΟΓΙΣΜΙΚΟ",
      "description": "Το μάθημα \"ΕΚΠΑΙΔΕΥΤΙΚΟ ΛΟΓΙΣΜΙΚΟ\" εισάγει τους φοιτητές στις βοηθούμενες από υπολογιστή ο-δηγίες και τα έξυπνα βοηθητικά συστήματα. Επικεντρώνεται στα μοντέλα χρήστη, με έμφαση στη διάγνωση λαθών, την αναπαράσταση του πεδίου γνώσης διδακτικών εφαρμογών, τον γεννήτορα συμβουλών και το σύστημα διεπαφής με τον μαθητή. Επίσης, παρουσιάζονται πρότυπα έξυπνων διδακτικών συστημάτων σε διάφορους τομείς και πολυμέσα.",
      "semester": 8,
      "trackId": 1
    },
    {
      "courseId": 50,
      "name": "ΕΠΕΞΕΡΓΑΣΙΑ ΣΗΜΑΤΩΝ ΦΩΝΗΣ ΚΑΙ ΗΧΟΥ",
      "description": "Το μάθημα \"Επεξεργασία Σημάτων Φωνής και Ήχου\" περιλαμβάνει εισαγωγή στη ψηφιακή επεξεργα-σία φωνής και ήχου, βασικές έννοιες ψηφιακής επεξεργασίας σήματος, παραγωγή ανθρώπινης ομι-λίας, ανάλυση και εκτίμηση παραμέτρων φωνής και ήχου, ψηφιακή κωδικοποίηση, σύνθεση ομιλίας από κείμενο και ήχους, και αυτοματοποιημένη αναγνώριση ομιλίας και φυσικής γλώσσας.",
      "semester": 8,
      "trackId": 1
    },
    {
      "courseId": 51,
      "name": "ΕΥΦΥΕΙΣ ΠΡΑΚΤΟΡΕΣ",
      "description": "Το μάθημα \"Ευφυείς Πράκτορες\" επικεντρώνεται στη δομή και λειτουργία ενός ευφυούς πράκτορα, αντιδρασιακούς και βουλητικούς πράκτορες, κύκλο αντιλαμβάνομαι-αποφασίζω-ενεργώ, μοντέλο BDI, εύρεση μονοπατιού, αναπαράσταση ενεργειών, σχεδιασμό ενεργειών βασισμένο σε κίνητρα και την πυραμίδα του Maslow, συναισθηματική υπολογιστική σε ευφυείς πράκτορες, ανάπτυξη συστημάτων ευφυών πρακτόρων, και εφαρμογές στην πλατφόρμα Unity3D.",
      "semester": 8,
      "trackId": 1
    }
  ]
}